cf_billing/Documents/энргУстановитьТехническуюВозможностьУстановкиПУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>энргУстановитьТехническуюВозможностьУстановкиПУ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.энргТехническаяВозможностьУстановкиПУ</xr:Item>
				<xr:Item>InformationRegister.энргУслугиТочекУчета</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контроллер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргСотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НетВозможностьУстановкиПУ</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/энргУстановитьТехническуюВозможностьУстановкиПУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд создания на основании.
// 
// Параметры:
//   КомандыСоздатьНаОсновании - состав команд.
// Возвращаемое значение:
//	 ТаблицаЗначений
//
Функция ДобавитьКомандыСозданияНаОсновании(КомандыСоздатьНаОсновании) Экспорт

	Возврат Документы.энргПерерасчет.ДобавитьКомандуСоздатьНаОснованииУстановитьВидБлагоустройстваАбонента(КомандыСоздатьНаОсновании);

КонецФункции

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
	
	энргВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);
			
КонецПроцедуры

#Область РеализацияИнтерфейса_РаботаСоСтабильнымиПериодыми

// Получает соответствие изменяемые параметры расчета.
// 
// Возвращаемое значение:
//   Соответствие.
//
Функция ИзменяемыеПараметрыРасчета() Экспорт 
	
	ИзменяемыеПараметрыРасчета 	= Новый Соответствие;                  	
	ИзменяемыеПараметры 		= Новый Массив;	
	ИзменяемыеПараметры.Добавить(Новый Структура("Ключи,Ресурсы","ТочкаУчета","НетВозможностьУстановкиПУ"));	
	ИзменяемыеПараметрыРасчета.Вставить(Перечисления.энргВидыОпераций.ПустаяСсылка(), ИзменяемыеПараметры);
	Возврат ИзменяемыеПараметрыРасчета;
	
КонецФункции

// Получает данные для проведения по стабильным периодам.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ВыбираемыеТаблицы	-	Массив.
//
Процедура ПолучитьДанныеДляПроведенияПоСтабильнымПериодам(Схема,ВыбираемыеТаблицы) Экспорт 
	
	перем Пакет;
	
	ИмяТаблицы 											= "ДанныеДокументовУстановитьТехническуюВозможностьУстановкиПУ";
	ВыбираемыеТаблицы.Добавить(ИмяТаблицы);
	
	врСхема 											= Новый СхемаЗапроса;
	врСхема.УстановитьТекстЗапроса(ТекстДляПроведенияПоСтабильнымПериодам());
	
	Пакет 												= врСхема.ПакетЗапросов[врСхема.ПакетЗапросов.Количество() - 1];
	Пакет.ТаблицаДляПомещения 							= ИмяТаблицы;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл
		Если Схема = Неопределено Тогда
			Схема 										= Новый СхемаЗапроса;
			Пакет 										= Схема.ПакетЗапросов[0];
		Иначе
			Пакет 										= Схема.ПакетЗапросов.Добавить();
		КонецЕсли;
		
		Пакет.УстановитьТекстЗапроса(врПакет.ПолучитьТекстЗапроса()); 		
	КонецЦикла;
	
	Для Каждого врПакет Из врСхема.ПакетЗапросов Цикл				
		Если НЕ врПакет.ТаблицаДляПомещения = ИмяТаблицы Тогда
			ПакетУничтожение 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросУничтоженияТаблицыСхемыЗапроса"));
			ПакетУничтожение.ИмяТаблицы 				= врПакет.ТаблицаДляПомещения;
		КонецЕсли;				
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстДляПроведенияПоСтабильнымПериодам()
	
	Текст 		=
	"ВЫБРАТЬ
	|	ДокументыДляПроведения.Организация КАК Организация,
	|	ДокументыДляПроведения.ПериодНачисления КАК ПериодНачисления,
	|	ДокументыДляПроведения.Район КАК Район,
	|	ДокументыДляПроведения.ЧастныйСектор КАК ЧастныйСектор,
	|	ДокументыДляПроведения.Строение КАК Строение,
	|	ДокументыДляПроведения.Помещение КАК Помещение,
	|	ДокументыДляПроведения.ПериодРегистрации КАК ПериодРегистрации,
	|	Шапка.Дата КАК ДатаРегистратора,
	|	ДокументыДляПроведения.ДокРегистратор КАК ДокРегистратор,
	|	ТаблицаТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	ТаблицаТочкиУчета.НетВозможностьУстановкиПУ КАК НетВозможностьУстановкиПУ
	|ИЗ
	|	ДокументыДляПроведения КАК ДокументыДляПроведения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьТехническуюВозможностьУстановкиПУ.ТочкиУчета КАК ТаблицаТочкиУчета
	|		ПО ДокументыДляПроведения.ДокРегистратор = ТаблицаТочкиУчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.энргУстановитьТехническуюВозможностьУстановкиПУ КАК Шапка
	|		ПО ДокументыДляПроведения.ДокРегистратор = Шапка.Ссылка";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
